/**
  ******************************************************************************
  * @file
  * @author
  * @version
  * @date
  * @brief   modbus 主机任务。
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/

#include <stdarg.h>
#include "stdio.h"
#include "freertos.h"
#include "task.h"
//#include "HWT605.h"
//#include "SonarModbus.h"
#include "stm32f4xx.h"

/* Private typedef -----------------------------------------------------------*/


/* Private define ------------------------------------------------------------*/


/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* public variables ----------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* public function prototypes ------------------------------------------------*/
void MbmApp_Task(void *pvParameters);
/* ----------------------- function ------------------------------------------*/

/**
  *****************************************************************************
  * @brief modbus 主机主任务，所有读取从机的任务都在这里
  * @note
  * @param None
  * @retval None
  * @date
  * @author
  *****************************************************************************
  */
void MbmApp_Task(void *pvParameters)
{
	vTaskDelay( 5 );			//延时等待主任务启动。
	while( 1 )
	{
		vTaskDelay( 1 );
	}
}
/************************(C) COPYRIGHT 2020  ROBOT++ *****END OF FILE**********/


